# 1. Необходимо описать методы API в классе для каждой из бирж: Binance, KuCoin. Затем необходимо, написать тесты для
# нескольких монет (Сравнить текущую стоимость, капитализацию и т.д.). Через параметризацию передавать разные монеты.
# Если цены монеты на разных биржах различаются, то записываем их в json файл следующим образом:
#
# {
#     'name': 'ETH',
#     'price_binance': 80_000,
#     'price_kucoin': 79_997,
#     'time_n_date': '11.11.2024 00:00'
# }
#
# Ссылки:
# https://binance-docs.github.io/apidocs/spot/en/#change-log/
# https://www.kucoin.com/docs/beginners/introduction